AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/boards/common5/examples/graphics/nemagfx_enhanced_stress_test/src/adc_task.c
//*****************************************************************************
//
//! @file adc_task.c
//!
//! @brief Task to handle adc operations.
//!
//! AM_DEBUG_PRINTF
//! If enabled, debug messages will be sent over ITM.
//!
//*****************************************************************************

//*****************************************************************************
//
// ${copyright}
//
// This is part of revision ${version} of the AmbiqSuite Development Package.
//
//*****************************************************************************

#include "nemagfx_enhanced_stress_test.h"

#if  ( ADC_TASK_ENABLE == 1 )

#define ADC_TASK_DEBUG_LOG
#define AUDADC_TEST
#define MAX_ADC_TASK_DELAY    (100*2)

#define ADC7_INPUT_PIN      12
//#define ADC6_INPUT_PIN      13 // conflicts with M2DISP Device Enable on AP5
#define ADC5_INPUT_PIN      14
#define ADC4_INPUT_PIN      15
#define ADC3_INPUT_PIN      16
//#define ADC2_INPUT_PIN      17
//#define ADC1_INPUT_PIN      18
//#define ADC0_INPUT_PIN      19

//*****************************************************************************
//
// Global Variables
//
//*****************************************************************************
//
// Pin configuration
//
#if defined(ADC7_INPUT_PIN)
const am_hal_gpio_pincfg_t g_ADC7_PIN_CFG =
{
    .GP.cfg_b.uFuncSel       = AM_HAL_PIN_12_ADCSE7,
};
#endif

#if defined(ADC6_INPUT_PIN)
const am_hal_gpio_pincfg_t g_ADC6_PIN_CFG =
{
    .GP.cfg_b.uFuncSel       = AM_HAL_PIN_13_ADCSE6,
};
#endif

#if defined(ADC5_INPUT_PIN)
const am_hal_gpio_pincfg_t g_ADC5_PIN_CFG =
{
    .GP.cfg_b.uFuncSel       = AM_HAL_PIN_14_ADCSE5,
};
#endif

#if defined(ADC4_INPUT_PIN)
const am_hal_gpio_pincfg_t g_ADC4_PIN_CFG =
{
    .GP.cfg_b.uFuncSel       = AM_HAL_PIN_15_ADCSE4,
};
#endif

#if defined(ADC3_INPUT_PIN)
const am_hal_gpio_pincfg_t g_ADC3_PIN_CFG =
{
    .GP.cfg_b.uFuncSel       = AM_HAL_PIN_16_ADCSE3,
};
#endif

#if defined(ADC2_INPUT_PIN)
const am_hal_gpio_pincfg_t g_ADC2_PIN_CFG =
{
    .GP.cfg_b.uFuncSel       = AM_HAL_PIN_17_ADCSE2,
};
#endif

#if defined(ADC1_INPUT_PIN)
const am_hal_gpio_pincfg_t g_ADC1_PIN_CFG =
{
    .GP.cfg_b.uFuncSel       = AM_HAL_PIN_18_ADCSE1,
};
#endif

#if defined(ADC0_INPUT_PIN)
const am_hal_gpio_pincfg_t g_ADC0_PIN_CFG =
{
    .GP.cfg_b.uFuncSel       = AM_HAL_PIN_19_ADCSE0,
};
#endif

//
// ADC Sample buffer.
//
#define ADC_SAMPLE_BUF_SIZE 128
AM_SHARED_RW uint32_t g_ui32ADCSampleBuffer[ADC_SAMPLE_BUF_SIZE];
am_hal_adc_sample_t SampleBuffer[ADC_SAMPLE_BUF_SIZE];

//
// ADC Global variables.
//
static void             *g_ADCHandle;
volatile bool           g_bADCDMAComplete;
volatile bool           g_bADCDMAError;

//
// AUDADC Sample buffer.
//
#define AUDADC_SAMPLE_BUF_SIZE      (8 * 1024)

#ifdef USE_EXTENDED_RAM
uint32_t *g_ui32AUDADCSampleBuffer = (uint32_t *)(0x101D0000);
#else
AM_SHARED_RW uint32_t g_ui32AUDADCSampleBuffer[AUDADC_SAMPLE_BUF_SIZE];
#endif

#define AUDADC_DATA_BUFFER_SIZE     (2 * AUDADC_SAMPLE_BUF_SIZE)
int16_t g_in16AudioDataBuffer[AUDADC_DATA_BUFFER_SIZE];

//
// AUDADC Global variables.
//
static void *g_AUDADCHandle;
volatile bool g_bAUDADCDMAComplete;
volatile bool g_bAUDADCDMAError;
volatile uint32_t g_ui32AudAdcDmaCount = 0;

//*****************************************************************************
//
// Interrupt handler for the ADC.
//
//*****************************************************************************
void
am_adc_isr(void)
{
    uint32_t ui32IntMask;

    //
    // Read the interrupt status.
    //
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_interrupt_status(g_ADCHandle, &ui32IntMask, false))
    {
        am_util_stdio_printf("Error reading ADC interrupt status\n");
        vErrorHandler();
    }

    //
    // Clear the ADC interrupt.
    //
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_interrupt_clear(g_ADCHandle, ui32IntMask))
    {
        am_util_stdio_printf("Error clearing ADC interrupt status\n");
        vErrorHandler();
    }

    //
    // If we got a DMA complete, set the flag.
    //
    if (ui32IntMask & AM_HAL_ADC_INT_FIFOOVR1)
    // (ui32IntMask & AM_HAL_ADC_INT_CNVCMP)   || (ui32IntMask & AM_HAL_ADC_INT_DCMP) ||
    // (ui32IntMask & AM_HAL_ADC_INT_SCNCMP))
    {
        if ( ADCn(0)->DMASTAT_b.DMACPL )
        {
            g_bADCDMAComplete = true;
        }
    }

    //
    // If we got a DMA error, set the flag.
    //
    if ( ui32IntMask & AM_HAL_ADC_INT_DERR )
    {
        am_util_stdio_printf("DMA Error\n");
        g_bADCDMAError = true;
        vErrorHandler();
    }
}

//*****************************************************************************
//
// Configure the ADC.
//
//*****************************************************************************
void
adc_config_dma(void)
{
    am_hal_adc_dma_config_t       ADCDMAConfig;

    //
    // Configure the ADC to use DMA for the sample transfer.
    //
    ADCDMAConfig.bDynamicPriority = true;
    ADCDMAConfig.ePriority = AM_HAL_ADC_PRIOR_SERVICE_IMMED;
    ADCDMAConfig.bDMAEnable = true;
    ADCDMAConfig.ui32SampleCount = ADC_SAMPLE_BUF_SIZE;
    ADCDMAConfig.ui32TargetAddress = (uint32_t)g_ui32ADCSampleBuffer;
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_configure_dma(g_ADCHandle, &ADCDMAConfig))
    {
        am_util_stdio_printf("Error - configuring ADC DMA failed.\n");
        vErrorHandler();
    }

    //
    // Reset the ADC DMA flags.
    //
    g_bADCDMAComplete = false;
    g_bADCDMAError = false;
}

//*****************************************************************************
//
// adc task handle.
//
//*****************************************************************************
TaskHandle_t AdcTaskHandle;

//*****************************************************************************
//
// Configure the ADC.
//
//*****************************************************************************
void
adc_config(void)
{
    am_hal_adc_config_t           ADCConfig;
    am_hal_adc_slot_config_t      ADCSlotConfig;

    //
    // Initialize the ADC and get the handle.
    //
    if ( AM_HAL_STATUS_SUCCESS != am_hal_adc_initialize(0, &g_ADCHandle) )
    {
        am_util_stdio_printf("Error - reservation of the ADC instance failed.\n");
        vErrorHandler();
    }
    //
    // Power on the ADC.
    //
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_power_control(g_ADCHandle,
                                                          AM_HAL_SYSCTRL_WAKE,
                                                          false) )
    {
        am_util_stdio_printf("Error - ADC power on failed.\n");
        vErrorHandler();
    }

    //
    // Set up internal repeat trigger timer
    //
    am_hal_adc_irtt_config_t      ADCIrttConfig =
    {
        .bIrttEnable        = true,
        .eClkDiv            = AM_HAL_ADC_RPTT_CLK_DIV2, // 48MHz
        .ui32IrttCountMax   = 20,   // 48MHz / 20 = 2.4MHz
    };

    am_hal_adc_configure_irtt(g_ADCHandle, &ADCIrttConfig);

    //
    // Set up the ADC configuration parameters. These settings are reasonable
    // for accurate measurements at a low sample rate.
    //

    //
    // For clock setting please refer to Errata 91: ADC : Loss of First Scan Data.
    //
    ADCConfig.eClock             = AM_HAL_ADC_CLKSEL_HFRC_24MHZ;
    ADCConfig.ePolarity          = AM_HAL_ADC_TRIGPOL_RISING;
    ADCConfig.eTrigger           = AM_HAL_ADC_TRIGSEL_SOFTWARE;
    ADCConfig.eClockMode         = AM_HAL_ADC_CLKMODE_LOW_LATENCY;
    ADCConfig.ePowerMode         = AM_HAL_ADC_LPMODE0;
    ADCConfig.eRepeat            = AM_HAL_ADC_REPEATING_SCAN;

    ADCConfig.eRepeatTrigger     = AM_HAL_ADC_RPTTRIGSEL_INT;

    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_configure(g_ADCHandle, &ADCConfig))
    {
        am_util_stdio_printf("Error - configuring ADC failed.\n");
        vErrorHandler();
    }

    //
    // Set up an ADC slot
    //
    ADCSlotConfig.eMeasToAvg      = AM_HAL_ADC_SLOT_AVG_128;
    ADCSlotConfig.ui32TrkCyc      = AM_HAL_ADC_MIN_TRKCYC;
    ADCSlotConfig.ePrecisionMode  = AM_HAL_ADC_SLOT_12BIT;

    ADCSlotConfig.bWindowCompare  = false;
    ADCSlotConfig.bEnabled        = true;
    //
    // Set a pin to act as our ADC input
    //
#if defined(ADC7_INPUT_PIN)
    am_hal_gpio_pinconfig(ADC7_INPUT_PIN, g_ADC7_PIN_CFG);
    ADCSlotConfig.eChannel        = AM_HAL_ADC_SLOT_CHSEL_SE7;
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_configure_slot(g_ADCHandle, 7, &ADCSlotConfig))
    {
        am_util_stdio_printf("Error - configuring ADC Slot 7 failed.\n");
        vErrorHandler();
    }
#endif

#if defined(ADC6_INPUT_PIN)
    am_hal_gpio_pinconfig(ADC6_INPUT_PIN, g_ADC6_PIN_CFG);
    ADCSlotConfig.eChannel        = AM_HAL_ADC_SLOT_CHSEL_SE6;
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_configure_slot(g_ADCHandle, 6, &ADCSlotConfig))
    {
        am_util_stdio_printf("Error - configuring ADC Slot 6 failed.\n");
        vErrorHandler();
    }
#endif

#if defined(ADC5_INPUT_PIN)
    am_hal_gpio_pinconfig(ADC5_INPUT_PIN, g_ADC5_PIN_CFG);
    ADCSlotConfig.eChannel        = AM_HAL_ADC_SLOT_CHSEL_SE5;
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_configure_slot(g_ADCHandle, 5, &ADCSlotConfig))
    {
        am_util_stdio_printf("Error - configuring ADC Slot 5 failed.\n");
        vErrorHandler();
    }
#endif

#if defined(ADC4_INPUT_PIN)
    am_hal_gpio_pinconfig(ADC4_INPUT_PIN, g_ADC4_PIN_CFG);
    ADCSlotConfig.eChannel        = AM_HAL_ADC_SLOT_CHSEL_SE4;
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_configure_slot(g_ADCHandle, 4, &ADCSlotConfig))
    {
        am_util_stdio_printf("Error - configuring ADC Slot 4 failed.\n");
        vErrorHandler();
    }
#endif

#if defined(ADC3_INPUT_PIN)
    am_hal_gpio_pinconfig(ADC3_INPUT_PIN, g_ADC3_PIN_CFG);
    ADCSlotConfig.eChannel        = AM_HAL_ADC_SLOT_CHSEL_SE3;
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_configure_slot(g_ADCHandle, 3, &ADCSlotConfig))
    {
        am_util_stdio_printf("Error - configuring ADC Slot 3 failed.\n");
        vErrorHandler();
    }
#endif

#if defined(ADC2_INPUT_PIN)
    am_hal_gpio_pinconfig(ADC2_INPUT_PIN, g_ADC2_PIN_CFG);
    ADCSlotConfig.eChannel        = AM_HAL_ADC_SLOT_CHSEL_SE2;
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_configure_slot(g_ADCHandle, 2, &ADCSlotConfig))
    {
        am_util_stdio_printf("Error - configuring ADC Slot 2 failed.\n");
        vErrorHandler();
    }

#endif

#if defined(ADC1_INPUT_PIN)
    am_hal_gpio_pinconfig(ADC1_INPUT_PIN, g_ADC1_PIN_CFG);
    ADCSlotConfig.eChannel        = AM_HAL_ADC_SLOT_CHSEL_SE1;
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_configure_slot(g_ADCHandle, 1, &ADCSlotConfig))
    {
        am_util_stdio_printf("Error - configuring ADC Slot 1 failed.\n");
        vErrorHandler();
    }
#endif

#if defined(ADC0_INPUT_PIN)
    am_hal_gpio_pinconfig(ADC0_INPUT_PIN, g_ADC0_PIN_CFG);
    ADCSlotConfig.eChannel        = AM_HAL_ADC_SLOT_CHSEL_SE0;
    if (AM_HAL_STATUS_SUCCESS != am_hal_adc_configure_slot(g_ADCHandle, 0, &ADCSlotConfig))
    {
        am_util_stdio_printf("Error - configuring ADC Slot 0 failed.\n");
        vErrorHandler();
    }
#endif



    //
    // Configure the ADC to use DMA for the sample transfer.
    //
    adc_config_dma();


