AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/boards/common5/examples/graphics/nemagfx_enhanced_stress_test/src/adc_task.c
                if (AM_HAL_STATUS_SUCCESS != am_hal_adc_samples_read(g_ADCHandle, false,
                                                                     g_ui32ADCSampleBuffer,
                                                                     &ui32SampleCount,
                                                                     SampleBuffer))
                {
                    am_util_stdio_printf("Error - failed to process samples.\n");
                    vErrorHandler();
                }

#if defined(ADC_TASK_DEBUG_LOG)
                am_util_stdio_printf("[ADC:%d] %x %x %x, slot is %d \n", ui32SampleCount, g_ui32ADCSampleBuffer[0], g_ui32ADCSampleBuffer[1], g_ui32ADCSampleBuffer[2], SampleBuffer->ui32Slot);
#endif
            }
            //
            // Reset the DMA completion and error flags.
            //
            g_bADCDMAComplete = false;

            //
            // Re-configure the ADC DMA.
            //
            adc_config_dma();

            //
            // Clear the ADC interrupts.
            //
            if (AM_HAL_STATUS_SUCCESS != am_hal_adc_interrupt_clear(g_ADCHandle, 0xFFFFFFFF))
            {
                am_util_stdio_printf("Error - clearing the ADC interrupts failed.\n");
                vErrorHandler();
            }

        } // if ()

#ifdef AUDADC_TEST
        //
        // Check if the AUDADC DMA completion interrupt occurred.
        //
        if (g_bAUDADCDMAComplete)
        {
            //DMA read.
            uint32_t  ui32SampleCount = AUDADC_SAMPLE_BUF_SIZE;
            for (int i = 0; i < ui32SampleCount; i++)
            {
               g_in16AudioDataBuffer[2 * i]     = (int16_t)(g_ui32AUDADCSampleBuffer[i] & 0x0000FFF0);          // Low-gain PGA sample data.
               g_in16AudioDataBuffer[2 * i + 1] = (int16_t)((g_ui32AUDADCSampleBuffer[i] >> 16) & 0x0000FFF0);  // High-gain PGA sample data.
            }

#if defined(ADC_TASK_DEBUG_LOG)
            am_util_stdio_printf("[AUDADC] %x %x %x\n", g_in16AudioDataBuffer[0], g_in16AudioDataBuffer[1], g_in16AudioDataBuffer[2]);
#endif
            //
            // Reset the DMA completion and error flags.
            //
            g_bAUDADCDMAComplete = false;

            //
            // Re-configure the AUDADC DMA.
            //
            audadc_config_dma();

            //
            // Clear the AUDADC interrupts.
            //
            if (AM_HAL_STATUS_SUCCESS != am_hal_audadc_interrupt_clear(g_AUDADCHandle, 0xFFFFFFFF))
            {
                am_util_stdio_printf("Error - clearing the AUDADC interrupts failed.\n");
                vErrorHandler();
            }

        }
#endif

    } // while()
}

#endif  //( ADC_TASK_ENABLE == 1 )
